#+title: Interface
*** The code

#+name: cursor-status
#+begin_src emacs-lisp
  ;; Change cursor color according to mode
  (defvar emagician-set-cursor-color-color "")
  (defvar emagician-set-cursor-color-type nil)
  (defvar emagician-set-cursor-color-buffer "")
  
  (defun emagician-set-cursor-color-according-to-mode ()
    "change cursor color according to some minor modes."
    ;; set-cursor-color is somewhat costly, so we only call it when needed:
    (let ((color (cond
                  ((comint-check-proc (current-buffer)) "blue")
                  (buffer-read-only "white")
                  ((not (equal buffer-file-name nil)) "grey50")
                  (t "cyan")))
          (type (cond
                 (overwrite-mode 'hollow)
                 (t 'box))))
      (unless (and
               (string= color emagician-set-cursor-color-color)
               (string= type emagician-set-cursor-color-type)
               (string= (buffer-name) emagician-set-cursor-color-buffer))
        (set-cursor-color (setq emagician-set-cursor-color-color color))
        (setq cursor-type (setq emagician-set-cursor-color-type type))
        (setq emagician-set-cursor-color-buffer (buffer-name)))))
  
  (add-hook 'post-command-hook 'emagician-set-cursor-color-according-to-mode)
#+end_src

#+RESULTS: cursor-status
| global-font-lock-mode-check-buffers | global-auto-complete-mode-check-buffers | global-undo-tree-mode-check-buffers | global-git-gutter-mode-check-buffers | global-edit-server-edit-mode-check-buffers | global-flycheck-mode-check-buffers | global-rainbow-delimiters-mode-check-buffers | global-hl-line-highlight | emagician-set-cursor-color-according-to-mode | mode-local-post-major-mode-change |

**** Moe theme integration :theme:
#+begin_src emacs-lisp 
;(powerline-moe-theme)
#+end_src

#+RESULTS:

For some reason powerline wants to be reset using ~powerline-center-theme~

#+begin_src emacs-lisp
(powerline-center-theme)
#+end_src

#+RESULTS:
| %e | (:eval (let* ((active (powerline-selected-window-active)) (mode-line (if active (quote mode-line) (quote mode-line-inactive))) (face1 (if active (quote powerline-active1) (quote powerline-inactive1))) (face2 (if active (quote powerline-active2) (quote powerline-inactive2))) (separator-left (intern (format powerline-%s-%s powerline-default-separator (car powerline-default-separator-dir)))) (separator-right (intern (format powerline-%s-%s powerline-default-separator (cdr powerline-default-separator-dir)))) (lhs (list (powerline-raw %* nil (quote l)) (powerline-buffer-size nil (quote l)) (powerline-buffer-id nil (quote l)) (powerline-raw  ) (funcall separator-left mode-line face1) (powerline-narrow face1 (quote l)) (powerline-vc face1))) (rhs (list (powerline-raw global-mode-string face1 (quote r)) (powerline-raw %4l face1 (quote r)) (powerline-raw : face1) (powerline-raw %3c face1 (quote r)) (funcall separator-right face1 mode-line) (powerline-raw  ) (powerline-raw %6p nil (quote r)) (powerline-hud face2 face1))) (center (list (powerline-raw   face1) (funcall separator-left face1 face2) (when (boundp (quote erc-modified-channels-object)) (powerline-raw erc-modified-channels-object face2 (quote l))) (powerline-major-mode face2 (quote l)) (powerline-process face2) (powerline-raw  : face2) (powerline-minor-modes face2 (quote l)) (powerline-raw   face2) (funcall separator-right face2 face1)))) (concat (powerline-render lhs) (powerline-fill-center face1 (/ (powerline-width center) 2.0)) (powerline-render center) (powerline-fill face1 (powerline-width rhs)) (powerline-render rhs)))) |

